configuration/src/Documents/Questionnaire/Questionnaire.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Questionnaire</name>
  <registerRecords>InformationRegister.QuestionnaireQuestionAnswers</registerRecords>
  <attributes>
    <name>Survey</name>
    <type>
      <types>DocumentRef.PollPurpose</types>
    </type>
  </attributes>
  <attributes>
    <name>Respondent</name>
    <type>
      <types>DefinedType.Respondent</types>
    </type>
  </attributes>
  <attributes>
    <name>EditDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SectionToEdit</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplateQuestions</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Interviewer</name>
    <type>
      <types>DefinedType.Interviewer</types>
    </type>
  </attributes>
  <attributes>
    <name>QuestionnaireTemplate</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>SurveyMode</name>
    <type>
      <types>EnumRef.SurveyModes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Content</name>
    <attributes>
      <name>DoQueryBox</name>
      <type>
        <types>CatalogRef.QuestionnaireTemplateQuestions</types>
      </type>
    </attributes>
    <attributes>
      <name>ElementaryQuestion</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>CellNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Response</name>
      <type>
        <types>Characteristic.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>OpenAnswer</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>IsUnanswered</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/InformationRegisters/QuestionnaireQuestionAnswers/QuestionnaireQuestionAnswers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>QuestionnaireQuestionAnswers</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Response</name>
    <type>
      <types>Characteristic.QuestionsForSurvey</types>
    </type>
  </resources>
  <attributes>
    <name>OpenAnswer</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsUnanswered</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Questionnaire</name>
    <type>
      <types>DocumentRef.Questionnaire</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DoQueryBox</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplateQuestions</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ElementaryQuestion</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CellNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/SurveyModes/SurveyModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SurveyModes</name>
  <enumValues>
    <name>Questionnaire</name>
  </enumValues>
  <enumValues>
    <name>Interview</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Questionnaire/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	InfobaseUpdate.CheckObjectProcessed(ThisObject);
	
EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	SetPrivilegedMode(True);
	
	RegisterRecords.QuestionnaireQuestionAnswers.Write = True;
	
	Query = New Query;
	Query.Text = "SELECT
	|	TableComposition.DoQueryBox,
	|	TableComposition.ElementaryQuestion,
	|	TableComposition.CellNumber,
	|	TableComposition.Response,
	|	TableComposition.OpenAnswer,
	|	TableComposition.LineNumber,
	|	TableComposition.IsUnanswered AS IsUnanswered
	|INTO Content
	|FROM
	|	&TableComposition AS TableComposition
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Content.DoQueryBox,
	|	Content.ElementaryQuestion,
	|	Content.CellNumber,
	|	CASE
	|		WHEN NOT Content.IsUnanswered
	|			THEN Content.Response
	|	END AS Response,
	|	Content.OpenAnswer,
	|	TRUE AS Active,
	|	&Ref AS Recorder,
	|	&Ref AS Questionnaire,
	|	Content.LineNumber AS LineNumber,
	|	Content.IsUnanswered AS IsUnanswered
	|FROM
	|	Content AS Content";
	
	Query.SetParameter("TableComposition",Content);
	Query.SetParameter("Ref",Ref);
	
	RegisterRecords.QuestionnaireQuestionAnswers.Load(Query.Execute().Unload());
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If FillingData <> Undefined Then
		FillPropertyValues(ThisObject,FillingData);
	EndIf;
	
	If SurveyMode = Enums.SurveyModes.Interview Then
		Interviewer = Users.CurrentUser();
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If SurveyMode = Enums.SurveyModes.Interview Then
		CheckedAttributes.Delete(CheckedAttributes.Find("Survey"));
	Else
		CheckedAttributes.Delete(CheckedAttributes.Find("QuestionnaireTemplate"));
	EndIf;
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
